38/data/attachments/5fd26d9d7e19e37b.txt

URL: http://www.advantageonlineshopping.com:80/accountservice/ws
SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>dtpkw</com:loginUser>
            <com:email>dtpkw@email.com</com:email>
            <com:loginPassword>Mgkdi839</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>
SOAP Response: 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:AccountLoginResponse xmlns:ns2="com.advantage.online.store.accountservice">
            <ns2:StatusMessage>
                <ns2:success>true</ns2:success>
                <ns2:userId>434862340</ns2:userId>
                <ns2:reason>Login Successful</ns2:reason>
                <ns2:token>eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJ3d3cuYWR2YW50YWdlb25saW5lc2hvcHBpbmcuY29tIiwidXNlcklkIjo0MzQ4NjIzNDAsInN1YiI6ImR0cGt3Iiwicm9sZSI6IlVTRVIifQ.kbwLLXb9yDYy0GNU2VlpfrfmNX9_JXbZK_-owdL3iZc</ns2:token>
                <ns2:sessionId>19994364ac8@7E991D62B1E^i%434862340</ns2:sessionId>
                <ns2:t_authorization>ZHRwa3c6TWdrZGk4Mzk=</ns2:t_authorization>
                <ns2:accountType>20</ns2:accountType>
            </ns2:StatusMessage>
        </ns2:AccountLoginResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
